## Data Science

##### Execute a cell: Press Shift + Enter to run the code in the current cell and automatically move to the next cell.

##### Execute the cell and insert a new one below: Use Alt + Enter to run the current cell and immediately add a new cell below it.

##### Add a new cell above the current cell: Simply press the 'A' key to insert a new cell right above the selected one.

##### Add a new cell below the current cell: Press the 'B' key to add a new cell just beneath the current one.

##### Delete the selected cell: Quickly remove the active cell by pressing the 'D' key twice in succession.

In [5]:
import pandas as pd

import seaborn as sns

In [108]:
!pip install seaborn

Requirement already satisfied: seaborn in c:\users\hibah\anaconda3\lib\site-packages (0.13.2)
Requirement already satisfied: numpy!=1.24.0,>=1.20 in c:\users\hibah\anaconda3\lib\site-packages (from seaborn) (1.26.4)
Requirement already satisfied: pandas>=1.2 in c:\users\hibah\anaconda3\lib\site-packages (from seaborn) (2.2.2)
Requirement already satisfied: matplotlib!=3.6.1,>=3.4 in c:\users\hibah\anaconda3\lib\site-packages (from seaborn) (3.9.2)
Requirement already satisfied: contourpy>=1.0.1 in c:\users\hibah\anaconda3\lib\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (1.2.0)
Requirement already satisfied: cycler>=0.10 in c:\users\hibah\anaconda3\lib\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (0.11.0)
Requirement already satisfied: fonttools>=4.22.0 in c:\users\hibah\anaconda3\lib\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (4.51.0)
Requirement already satisfied: kiwisolver>=1.3.1 in c:\users\hibah\anaconda3\lib\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (1.4.4)
Requirement already satisfied: packaging>=20.0 in c:\users\hibah\anaconda3\lib\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (24.1)
Requirement already satisfied: pillow>=8 in c:\users\hibah\anaconda3\lib\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (10.4.0)
Requirement already satisfied: pyparsing>=2.3.1 in c:\users\hibah\anaconda3\lib\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (3.1.2)
Requirement already satisfied: python-dateutil>=2.7 in c:\users\hibah\anaconda3\lib\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\hibah\anaconda3\lib\site-packages (from pandas>=1.2->seaborn) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\hibah\anaconda3\lib\site-packages (from pandas>=1.2->seaborn) (2023.3)
Requirement already satisfied: six>=1.5 in c:\users\hibah\anaconda3\lib\site-packages (from python-dateutil>=2.7->matplotlib!=3.6.1,>=3.4->seaborn) (1.16.0)

In [9]:
list1 = [10, 20, 30, 40, 50, 60, 70, 80, 90]

series = pd.Series(list1)
print(series)

0    10
1    20
2    30
3    40
4    50
5    60
6    70
7    80
8    90
dtype: int64

In [19]:
print(list1[:5])

[10, 20, 30, 40, 50]

In [21]:
print(list1[4:])

[50, 60, 70, 80, 90]

In [23]:
index = pd.Series([10,20,30,4],index = ["a", "b", "c", "d"])
index

a    10
b    20
c    30
d     4
dtype: int64

In [25]:
index[:"c"]

a    10
b    20
c    30
dtype: int64

In [27]:
index[:"a"]

a    10
dtype: int64

In [29]:
index[:"b"]

a    10
b    20
dtype: int64

In [31]:
index[:"d"]

a    10
b    20
c    30
d     4
dtype: int64

In [33]:
index[:"e"]

a    10
b    20
c    30
d     4
dtype: int64

In [35]:
index["b"]

20

In [37]:
# modfying a value in a list

list1

[10, 20, 30, 40, 50, 60, 70, 80, 90]

In [45]:
list1 [2] = [21]
list1

[10, 20, [21], 40, 50, 60, 70, 80, 90]

In [59]:
# Vectorized Operations
# add 2 to each element. the output should be [4, 6, 8, 10, 12]

list1 = [2, 4, 6, 8, 10]
list2 = []

for i in list1:
    x = i + 2
    list2.append(x)
print(list2)




# add 2 to each element. the output should be [8 ,16 , 24, 32, 40]

list1 = [2, 4, 6, 8, 10]
list2  = []

for i in list1:
    y = i * 4
    list2.append(y)
print(list2)

[4, 6, 8, 10, 12]
[8, 16, 24, 32, 40]

In [71]:
series


series2 = series + 2
series2



series3 = series * 4
series3

0     40
1     80
2    120
3    160
4    200
5    240
6    280
7    320
8    360
dtype: int64

In [77]:
# mathematical functions
'''Lambda is an anonymous function, 
In a normal function we use def keyword followed by function name.
But in lambda function, we use lambda keyword to define lambda function.
lambda argument:expression'''

# Normal function:
def func(x):
    return x**2

func(8)



# Lambda function:
lam = lambda y:y**2
lam(4)

print(series.apply(lambda))

16

In [81]:
# Handling missing values

series_na = pd.Series([5, 10, 15, None, 25])
series_na

0     5.0
1    10.0
2    15.0
3     NaN
4    25.0
dtype: float64

In [83]:
series_na.isna()

0    False
1    False
2    False
3     True
4    False
dtype: bool

In [85]:
series_na

0     5.0
1    10.0
2    15.0
3     NaN
4    25.0
dtype: float64

In [87]:
series_na.fillna(1, inplace = True)
series_na

0     5.0
1    10.0
2    15.0
3     1.0
4    25.0
dtype: float64

## Data Frames

In [98]:
df = pd.DataFrame({'Country':['India', 'USA', 'UK'], 'State':['Telangana', 'Canada', 'Birmingham'], 'Capital':["NewDelhi", 'Washington DC', 'Palace']})
df

  Country       State        Capital
0   India   Telangana       NewDelhi
1     USA      Canada  Washington DC
2      UK  Birmingham         Palace

In [114]:
df1 = sns.get_dataset_names()
print(df1)

['anagrams', 'anscombe', 'attention', 'brain_networks', 'car_crashes', 'diamonds', 'dots', 'dowjones', 'exercise', 'flights', 'fmri', 'geyser', 'glue', 'healthexp', 'iris', 'mpg', 'penguins', 'planets', 'seaice', 'taxis', 'tips', 'titanic']

In [112]:
df1 = sns.load_dataset("titanic")
df1

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [15]:
df_csv = pd.read_csv("C:/Users/hibah/Downloads/data_csv.csv").head(10)
print(df_csv)

                 Province/State       Country/Region       Lat        Long  \
0                           NaN          Afghanistan  33.93911   67.709953
1                           NaN              Albania  41.15330   20.168300
2                           NaN              Algeria  28.03390    1.659600
3                           NaN              Andorra  42.50630    1.521800
4                           NaN               Angola -11.20270   17.873900
5                           NaN  Antigua and Barbuda  17.06080  -61.796400
6                           NaN            Argentina -38.41610  -63.616700
7                           NaN              Armenia  40.06910   45.038200
8  Australian Capital Territory            Australia -35.47350  149.012400
9               New South Wales            Australia -33.86880  151.209300

         Date  Confirmed  Deaths  Recovered  Active             WHO Region
0  2020-01-22          0       0          0       0  Eastern Mediterranean
1  2020-01-22          0       0          0       0                 Europe
2  2020-01-22          0       0          0       0                 Africa
3  2020-01-22          0       0          0       0                 Europe
4  2020-01-22          0       0          0       0                 Africa
5  2020-01-22          0       0          0       0               Americas
6  2020-01-22          0       0          0       0               Americas
7  2020-01-22          0       0          0       0                 Europe
8  2020-01-22          0       0          0       0        Western Pacific
9  2020-01-22          0       0          0       0        Western Pacific

In [1]:
print()